In [2]:
import pandas as pd
import numpy as np

In [20]:
evaluation = pd.read_csv("evaluation.csv", delimiter="|")
APU = pd.read_csv("Uni_Asia_Pacific_1.csv", delimiter="|")

In [21]:
evaluation.head(5)

   itemID
0      12
1   45274
2   10104
3   41371
4   14015

In [22]:
APU.head(5)

   itemID   rec1   rec2   rec3   rec4   rec5
0      12  72603  11989  11117   3106  44220
1   45274  14576  73124  33976  63166  54393
2   41371  14576  73124  33976  63166  54393
3   14015  72603  11989  11117   3106  44220
4   70766  72603  11989  11117   3106  44220

In [23]:
print(evaluation.shape)
print(APU.shape)

(1000, 1)
(1037, 6)

In [24]:
test = pd.merge(APU, evaluation, how='inner', on=["itemID"])

In [25]:
test.shape

(1037, 6)

In [26]:
test.head(10)

   itemID   rec1   rec2   rec3   rec4   rec5
0      12  72603  11989  11117   3106  44220
1   45274  14576  73124  33976  63166  54393
2   41371  14576  73124  33976  63166  54393
3   41371  58723   2408  30277  29508  15581
4   14015  72603  11989  11117   3106  44220
5   70766  72603  11989  11117   3106  44220
6   70766   4892  44815  63847  64544   2417
7    1822  72603  11989  11117   3106  44220
8    1822   4892  44815  63847  64544   2417
9   56794  72603  11989  11117   3106  44220

In [28]:
print(test['itemID'].value_counts())

50338    2
2074     2
2335     2
13269    2
7129     2
        ..
68427    1
11609    1
68560    1
9179     1
30725    1
Name: itemID, Length: 630, dtype: int64

In [44]:
# create DF to show the itemID where count is = 1 or = 2
df_1 = test.groupby('itemID').filter(lambda x: len(x) == 1)
df_2 = test.groupby('itemID').filter(lambda x: len(x) == 2)

print(df_1.shape)
print(df_2.shape)

(223, 6)
(814, 6)

In [53]:
df_1.head(10)

    itemID   rec1   rec2   rec3   rec4   rec5
0       12  72603  11989  11117   3106  44220
1    45274  14576  73124  33976  63166  54393
4    14015  72603  11989  11117   3106  44220
19   39779  72603  11989  11117   3106  44220
26   65307  72603  11989  11117   3106  44220
43   71586  72603  11989  11117   3106  44220
52   15657  72603  11989  11117   3106  44220
59   43844  72603  11989  11117   3106  44220
80    9365  72603  11989  11117   3106  44220
81   11177  72603  11989  11117   3106  44220

In [54]:
df_2.head(20)

    itemID   rec1   rec2   rec3   rec4   rec5
2    41371  14576  73124  33976  63166  54393
5    70766  72603  11989  11117   3106  44220
7     1822  72603  11989  11117   3106  44220
9    56794  72603  11989  11117   3106  44220
11   73378  72603  11989  11117   3106  44220
13   24603  72603  11989  11117   3106  44220
15    5737   4892  63847  53706  26528   7464
17   38980  72603  11989  11117   3106  44220
20   51066  72603  11989  11117   3106  44220
22   67776  14576  73124  33976  63166  54393
24   53929  14576  73124  33976  63166  54393
27   62494   4892  63847  53706  26528   7464
29   53008  72603  11989  11117   3106  44220
31    4690  17731  29508  55699  62433   4283
33   65353  14576  73124  33976  63166  54393
35   61593  14576  73124  33976  63166  54393
37   18537  17342  23574  10522  25881   1193
39   73427  72603  11989  11117   3106  44220
41    7521  72603  11989  11117   3106  44220
44   13772  72603  11989  11117   3106  44220

In [55]:
#Remove duplicate 

test.drop_duplicates(subset ="itemID", keep='first' ,inplace=True)
test

      itemID   rec1   rec2   rec3   rec4   rec5
0         12  72603  11989  11117   3106  44220
1      45274  14576  73124  33976  63166  54393
2      41371  14576  73124  33976  63166  54393
4      14015  72603  11989  11117   3106  44220
5      70766  72603  11989  11117   3106  44220
...      ...    ...    ...    ...    ...    ...
1032   39201   4892  44815  63847  64544   2417
1033   26764   4892  44815  63847  64544   2417
1034   14782  75659   3106   4283  31293  71747
1035   17138  58723   2408  30277  29508  15581
1036   23570  63166  54393  56766  75990  66314

[630 rows x 6 columns]

In [56]:
final_df = pd.merge(test, evaluation, how='inner', on=["itemID"])
final_df.shape

(630, 6)

In [57]:
final_df

     itemID   rec1   rec2   rec3   rec4   rec5
0        12  72603  11989  11117   3106  44220
1     45274  14576  73124  33976  63166  54393
2     41371  14576  73124  33976  63166  54393
3     14015  72603  11989  11117   3106  44220
4     70766  72603  11989  11117   3106  44220
..      ...    ...    ...    ...    ...    ...
625   39201   4892  44815  63847  64544   2417
626   26764   4892  44815  63847  64544   2417
627   14782  75659   3106   4283  31293  71747
628   17138  58723   2408  30277  29508  15581
629   23570  63166  54393  56766  75990  66314

[630 rows x 6 columns]